InformationRegisters/ДвижениеОсновныхДеталей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеОсновныхДеталей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДетали</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СервисТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьРемонтаОД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Деталь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ФункцииДеталей/Ext/Module.bsl
// Функция - Получение списка основных деталей соответствующих указанному статусу и ресурсу регистра сведений при необходимости
//
// Параметры:
//  Статус	 - ПеречислениеСсылка.СтатусДетали 	 - Необходимый статус основных деталей
//  НазваниеРесурса	 - Строка	 - К примеру терминал
//  ЗначениеРесурса	 - Ссылка	 - К примеру ссылка на конкретный терминал
// 
// Возвращаемое значение:
//  СписокЗначений - Список значений основных деталей
//
&НаСервере
Функция ПолучениеОсновныхДеталей(Знач Статус, Знач НазваниеРесурса = Null, Знач ЗначениеРесурса = Null) Экспорт
	ИндексЗначения = Перечисления.СтатусДетали.Индекс(Статус);
	Список = Новый СписокЗначений;
	Если Не (НазваниеРесурса = Null и ЗначениеРесурса = Null) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|ДвижениеОсновныхДеталейСрезПоследних.Деталь КАК Деталь 
		|ИЗ 
		|	РегистрСведений.ДвижениеОсновныхДеталей.СрезПоследних КАК ДвижениеОсновныхДеталейСрезПоследних 
		|ГДЕ 
		|	ДвижениеОсновныхДеталейСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусДетали."+Метаданные.Перечисления.СтатусДетали.ЗначенияПеречисления[ИндексЗначения].Имя+")	
		|	И ДвижениеОсновныхДеталейСрезПоследних."+НазваниеРесурса+" = &ЗначениеРесурса");
		Запрос.УстановитьПараметр("ЗначениеРесурса", ЗначениеРесурса);
	ИначеЕсли Не НазваниеРесурса = Null и ЗначениеРесурса = Null Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|ДвижениеОсновныхДеталейСрезПоследних.Деталь КАК Деталь 
		|ИЗ 
		|	РегистрСведений.ДвижениеОсновныхДеталей.СрезПоследних КАК ДвижениеОсновныхДеталейСрезПоследних 
		|ГДЕ 
		|	ДвижениеОсновныхДеталейСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусДетали."+Метаданные.Перечисления.СтатусДетали.ЗначенияПеречисления[ИндексЗначения].Имя+")");
	Иначе
		Список.Добавить(Справочники.ОсновныеСредства.ПустаяСсылка(), "Получены не все данные");
	КонецЕсли;
	//Сохраняем полученный массив основных деталей при выполнении запроса
	МассивДеталей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Деталь");
	//Создаём список значений
	Список = Новый СписокЗначений;
	//Загружаем список значений
	Если МассивДеталей.Количество() > 0 Тогда
		Для ИндексМассива = 0 По МассивДеталей.Количество() - 1 Цикл
        	Список.Добавить(МассивДеталей[ИндексМассива],МассивДеталей[ИндексМассива].СерийныйНомерСправочник+", "+МассивДеталей[ИндексМассива].Наименование);
		КонецЦикла;
	Иначе
		Список.Добавить(Справочники.ОсновныеСредства.ПустаяСсылка(), "Нет деталей");
	КонецЕсли;
	//Возвращаем список значений на клиент
	Возврат Список;
КонецФункции
